Tekla.Structures.Drawing.View.ViewAttributes
The ViewAttributes class contains the attributes for the view.

Tekla.Structures.Drawing.View.ViewAttributes.PartialProfileLength
Gets or sets the partial profile length.

Tekla.Structures.Drawing.View.ViewAttributes.PartialProfileOffset
Gets or sets the partial profile offset

Tekla.Structures.Drawing.View.ViewAttributes.ReflectedView
Defines whether the view is reflected or not.

Tekla.Structures.Drawing.View.ViewAttributes.UnfoldedView
Defines whether the view is unfolded or not.

Tekla.Structures.Drawing.View.ViewAttributes.UndeformedView
Defines whether the view is undeformed or not.

Tekla.Structures.Drawing.View.ViewAttributes.ViewExtensionForNeighbourParts
The view extension for neighbour parts.

Tekla.Structures.Drawing.View.ViewAttributes.FixedViewPlacing
Defines whether the view placing is fixed (true) or free (false).

Tekla.Structures.Drawing.View.ViewAttributes.Shortening
Gets or sets the shortening attributes for the view.

Tekla.Structures.Drawing.View.ViewAttributes.ShowPartOpeningsOrRecessSymbol
Defines whether to show the openings/recess symbol or not.

Tekla.Structures.Drawing.View.ViewAttributes.Scale
The view scale.

Tekla.Structures.Drawing.View.ViewAttributes.ViewPlaneDatumPointForElevations
Defines whether the datum point for elevations is view plane based (true) or specified (false).
When set to false, the value of DatumLevel is used.
When set to true, DatumLevel will be set to 0.0.

Tekla.Structures.Drawing.View.ViewAttributes.LocationByModelOrigin
A constant string defining that the view location is calculated by model origin.

Tekla.Structures.Drawing.View.ViewAttributes.LocationByProjectBasePoint
A constant string defining that the view location is calculated by project base point.

Tekla.Structures.Drawing.View.ViewAttributes.LocationBy
Gets or sets the location by attribute.
Value is ViewAttributes.LocationByModelOrigin, ViewAttributes.LocationByProjectBasePoint or guid of a Basepoint.

Tekla.Structures.Drawing.View.ViewAttributes.DatumLevel
The specified datum level.
If ViewPlaneDatumPointForElevations is set to true when DatumLevel is set,
the value of ViewPlaneDatumPointForElevations will change to false.

Tekla.Structures.Drawing.View.ViewAttributes.PourView
Defines whether the view is pour view or not.

Tekla.Structures.Drawing.View.ViewAttributes.MarkSymbolColor
The color of the mark symbol (see Tekla.Structures.Drawing.DrawingColors for options).

Tekla.Structures.Drawing.View.ViewAttributes.TrueMarkSymbolColor
The true color (rgb enabled) of the mark symbol.
Throws System.ArgumentOutOfRangeException: The get method will
throw if the inputColor is not supported (0-7, 120 for example).
You should use this function in a try-catch statement, since
non-supported colors are used in TeklaStructures, especially in
older models. Define your own catch logic (default color, error
message, etc) based on your use case.

Tekla.Structures.Drawing.View.ViewAttributes.MarkSymbolAttributes
The view mark symbol attributes.

Tekla.Structures.Drawing.View.ViewAttributes.LabelPositionVertical
The vertical position of the view label.

Tekla.Structures.Drawing.View.ViewAttributes.LabelPositionHorizontal
The horizontal position of the view label.

Tekla.Structures.Drawing.View.ViewAttributes.TagsAttributes
The attributes for view mark tags.

Tekla.Structures.Drawing.View.ViewAttributes.BoltHolesVisible
Defines whether the bolt holes are visible in the drawing view or not.

Tekla.Structures.Drawing.View.ViewAttributes.BoltSymbolVisible
Defines whether the bolt symbol is visible in the drawing view or not.

Tekla.Structures.Drawing.View.ViewAttributes.WeldVisible
Defines whether the weld is visible in the drawing view or not.

Tekla.Structures.Drawing.View.ViewAttributes.RebarVisible
Defines whether the rebar is visible in the drawing view or not.

Tekla.Structures.Drawing.View.ViewAttributes.GridVisible
Defines whether the grid is visible in the drawing view or not.

Tekla.Structures.Drawing.View.ViewAttributes.#ctor(System.Boolean)
Creates a new default view attributes instance that doesn't load attributes.
SkipLoading value does make any difference.

Tekla.Structures.Drawing.View.ViewAttributes.#ctor
Creates a new view attributes instance that loads standard attributes.

Tekla.Structures.Drawing.View.ViewAttributes.#ctor(System.String)
Creates a new view attributes instance that loads the specified attributes.
AttributesFile: The name of the attributes file.

Tekla.Structures.Drawing.View.ViewAttributes.LoadAttributes(System.String)
Loads the attributes from the attribute file.
attributeFile: The attribute file's filename.
Returns: True if the attributes are loaded correctly. False if the attribute file loading failed.

Tekla.Structures.Drawing.View.ViewAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.